### series

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr= np.array([10,20,30])
d={'a':10,'b':20,'c':100}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a     10
b     20
c    100
dtype: int64

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1=pd.Series([1,2,3,4],index=['US','CHINA','france','germany'])
ser1

US         1
CHINA      2
france     3
germany    4
dtype: int64

In [12]:
ser2=pd.Series([1,2,3,4],index=['US','CHINA','ITALY','JAPAN'])

In [13]:
ser2

US       1
CHINA    2
ITALY    3
JAPAN    4
dtype: int64

In [14]:
ser2['US']

1

In [15]:
ser1+ser2

CHINA      4.0
ITALY      NaN
JAPAN      NaN
US         2.0
france     NaN
germany    NaN
dtype: float64

In [16]:
from numpy.random import randn
np.random.seed(101)

In [17]:
df=pd.DataFrame(randn(3,4),['A','B','C'],['W','X','Y','Z'])

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [19]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
Name: W, dtype: float64

In [20]:
type (df['W'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.W ##dont use this often

A    2.706850
B    0.651118
C   -2.018168
Name: W, dtype: float64

In [23]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
Name: X, dtype: float64

In [24]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001

In [25]:
df['new']=df['W']+df['Y']

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [27]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [28]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [29]:
df ##new is still present

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [30]:
df.drop('new',axis=1,inplace=True) ##if the change needs to be made permanent, set inplace to TRUE

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [32]:
df.drop('C')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [33]:
df.shape

(3, 4)

In [34]:
## SELECTING ROWS

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [36]:
df.loc['A'] ##rows are series as well like columns

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [37]:
df.iloc[2] ##thru nmerical base index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [38]:
df.loc['B','Y']

-0.8480769834036315

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [40]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [41]:
booldf = df>0
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [43]:
df['W']>0

A     True
B     True
C    False
Name: W, dtype: bool

In [44]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [46]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [47]:
resultdf=df[df['W']>0]

In [48]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [49]:
resultdf['X']

A    0.628133
B   -0.319318
Name: X, dtype: float64

In [50]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
Name: X, dtype: float64

In [51]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318

In [53]:
boolser = df['W']>0 ##breaking prev one liner into multiple lines, taking more space
result=df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318

In [54]:
df[(df['W']>0) and (df['Y']>1)] ## and operator can take series boolean into account

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [56]:
df[(df['W']>0)  & (df['Y']>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [60]:
df[(df['W']>0)  | (df['Y']>1)] ## or = |

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [61]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001

In [64]:
newind='CA NY WY'.split()
newind

['CA', 'NY', 'WY']

In [65]:
df['STATES']= newind

In [66]:
df

          W         X         Y         Z STATES
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY

In [67]:
df.set_index('STATES')

               W         X         Y         Z
STATES
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001

In [69]:
df

          W         X         Y         Z STATES
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY

In [70]:
import numpy as np ##multilevel index dataset creation
import pandas as pd
outside=['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [71]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [72]:
inside

[1, 2, 3, 1, 2, 3]

In [73]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [74]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [75]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [76]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [77]:
df

             A         B
G1 1  0.188695 -0.758872
   2 -0.933237  0.955057
   3  0.190794  1.978757
G2 1  2.605967  0.683509
   2  0.302665  1.693723
   3 -1.706086 -1.159119

In [78]:
df.loc['G1']

          A         B
1  0.188695 -0.758872
2 -0.933237  0.955057
3  0.190794  1.978757

In [79]:
df.index.names

FrozenList([None, None])

In [80]:
df.index.names = ['GROUPS','NUM']
df

                   A         B
GROUPS NUM
G1     1    0.188695 -0.758872
       2   -0.933237  0.955057
       3    0.190794  1.978757
G2     1    2.605967  0.683509
       2    0.302665  1.693723
       3   -1.706086 -1.159119

In [81]:
df.loc['G2'].loc[2]

A    0.302665
B    1.693723
Name: 2, dtype: float64

In [82]:
df.loc['G2'].loc[2]['B']

1.693722925204035

In [83]:
df.xs(1,level='NUM')

               A         B
GROUPS
G1      0.188695 -0.758872
G2      2.605967  0.683509

### Pandas- Groupby

In [84]:
import numpy as np
import pandas as pd

In [87]:
data ={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'person':['Sam','Charlie','CJ','DF','TY','PJ'],
      'sales':[200,120,340,124,345,654]}

In [88]:
df=pd.DataFrame(data)

In [89]:
df

  Company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT       CJ    340
3    MSFT       DF    124
4      FB       TY    345
5      FB       PJ    654

In [91]:
df.groupby('Company')

In [92]:
bycomp=df.groupby('Company')

In [93]:
bycomp.mean()

         sales
Company
FB       499.5
GOOG     160.0
MSFT     232.0

In [94]:
bycomp.sum()

         sales
Company
FB         999
GOOG       320
MSFT       464

In [96]:
bycomp.sum().loc['FB']

sales    999
Name: FB, dtype: int64

In [97]:
df.groupby('Company').count()

         person  sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [98]:
df.groupby('Company').min()

          person  sales
Company
FB            PJ    345
GOOG     Charlie    120
MSFT          CJ    124

In [101]:
df.groupby('Company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  499.5  218.495995  345.0  422.25  499.5  576.75  654.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [102]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   499.500000  160.000000  232.000000
      std    218.495995   56.568542  152.735065
      min    345.000000  120.000000  124.000000
      25%    422.250000  140.000000  178.000000
      50%    499.500000  160.000000  232.000000
      75%    576.750000  180.000000  286.000000
      max    654.000000  200.000000  340.000000

In [103]:
df.groupby('Company').describe().transpose()['FB']

sales  count      2.000000
       mean     499.500000
       std      218.495995
       min      345.000000
       25%      422.250000
       50%      499.500000
       75%      576.750000
       max      654.000000
Name: FB, dtype: float64

### merging, joining, concatenating

In [104]:
import pandas as pd

In [105]:
df1 = pd.DataFrame ({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                   index =[0,1,2,3])

In [106]:
df2 = pd.DataFrame ({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                   index =[4,5,6,7])

In [107]:
df3 = pd.DataFrame ({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                   index =[8,9,10,11])

In [108]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [109]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [110]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [111]:
pd.concat([df1,df2,df3]) ##axis = 0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [112]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [119]:

left=pd.DataFrame ({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                  'Key':['K0','K1','K2','K3']})

In [120]:
right=pd.DataFrame ({'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],
                    'Key':['K0','K1','K2','K3']})

In [121]:
left

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [122]:
right

    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [123]:
pd.merge(left,right,how='inner',on='Key') ##inner, outer, left, right

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [125]:
left = pd.DataFrame ({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2']},
                    index = ['K0','K1','K2'])
right = pd.DataFrame ({'C':['C0','C1','C3'],
                     'D':['D0','D1','D3']},
                    index = ['K0','K1','K3'])

left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1   C1   D1
K2  A2  B2  NaN  NaN

In [127]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1   C1   D1
K2   A2   B2  NaN  NaN
K3  NaN  NaN   C3   D3

### Missing Data

In [128]:
import numpy as np
import pandas as pd

In [129]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [130]:
df=pd.DataFrame(d)

In [131]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [132]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [133]:
df.dropna(axis=1) ## axis = 0 for rows =1 for columns

   C
0  1
1  2
2  3

In [134]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [135]:
df.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [142]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [140]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### operations

In [143]:
import numpy as np
import pandas as pd
df =pd.DataFrame ({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [144]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [146]:
df['col2'].nunique()

3

In [147]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [148]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [149]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [150]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [151]:
def times2(x):
    return x*2

In [152]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [153]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [156]:
df.columns ##col1 hata dia tha inplace true set krke :/

Index(['col2', 'col3'], dtype='object')

In [157]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [158]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [159]:
df.sort_values('col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [161]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [162]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['ONE','ONE','TWO','TWO','ONE','ONE'],
       'C':['X','Y','X','Y','X','Y'],
       'D':[1,3,2,4,6,1]}
df=pd.DataFrame(data)

In [163]:
df

     A    B  C  D
0  foo  ONE  X  1
1  foo  ONE  Y  3
2  foo  TWO  X  2
3  bar  TWO  Y  4
4  bar  ONE  X  6
5  bar  ONE  Y  1

In [165]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          X    Y
A   B
bar ONE  6.0  1.0
    TWO  NaN  4.0
foo ONE  1.0  3.0
    TWO  2.0  NaN

### DATA INPUT AND OUTPUT

In [166]:
pwd ##location of jupyter notebooks

'C:\\Users\\cheha'

In [169]:
df = pd.read_excel('Book1.xlsx')

In [170]:
df

    0   1   2   3
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15

In [174]:
df.to_excel('my_output.xlsx') ##changing name

In [175]:
df

    0   1   2   3
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15

In [176]:
from sqlalchemy import create_engine

In [177]:
engine = create_engine('sqlite:///:memory:')

In [178]:
df.to_sql('my_output',engine)

In [182]:
sqldf=pd.read_sql('my_output',con=engine)

In [183]:
sqldf

   index   0   1   2   3
0      0   4   5   6   7
1      1   8   9  10  11
2      2  12  13  14  15

### exercise

In [185]:
import pandas as pd
banks=pd.read_csv('banklist.csv')

In [186]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,01-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,05-May-17,01-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,03-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [188]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [189]:
## no of states
banks['ST'].nunique()

44

In [190]:
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [191]:
## top 5 banks with most failed banks
banks.groupby("ST").count()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
AL          7     7     7                      7             7             7
AR          3     3     3                      3             3             3
AZ         16    16    16                     16            16            16
CA         41    41    41                     41            41            41
CO         10    10    10                     10            10            10
CT          2     2     2                      2             2             2
FL         75    75    75                     75            75            75
GA         93    93    93                     93            93            93
HI          1     1     1                      1             1             1
IA          2     2     2                      2             2             2
ID          2     2     2                      2             2             2
IL         67    67    67                     67            67            67
IN          3     3     3                      3             3             3
KS          9     9     9                      9             9             9
KY          2     2     2                      2             2             2
LA          4     4     4                      4             4             4
MA          1     1     1                      1             1             1
MD         10    10    10                     10            10            10
MI         14    14    14                     14            14            14
MN         23    23    23                     23            23            23
MO         16    16    16                     16            16            16
MS          2     2     2                      2             2             2
NC          7     7     7                      7             7             7
NE          3     3     3                      3             3             3
NH          1     1     1                      1             1             1
NJ          7     7     7                      7             7             7
NM          3     3     3                      3             3             3
NV         12    12    12                     12            12            12
NY          5     5     5                      5             5             5
OH          8     8     8                      8             8             8
OK          7     7     7                      7             7             7
OR          6     6     6                      6             6             6
PA         10    10    10                     10            10            10
PR          4     4     4                      4             4             4
SC         10    10    10                     10            10            10
SD          1     1     1                      1             1             1
TN          7     7     7                      7             7             7
TX         12    12    12                     12            12            12
UT          8     8     8                      8             8             8
VA          5     5     5                      5             5             5
WA         19    19    19                     19            19            19
WI         11    11    11                     11            11            11
WV          1     1     1                      1             1             1
WY          1     1     1                      1             1             1

In [192]:
banks.groupby("ST").count().sort_values('Bank Name').tail()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
MN         23    23    23                     23            23            23
CA         41    41    41                     41            41            41
IL         67    67    67                     67            67            67
FL         75    75    75                     75            75            75
GA         93    93    93                     93            93            93

In [193]:
banks.groupby("ST").count().sort_values('Bank Name',ascending=False).iloc[:5]['Bank Name']

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

In [196]:
##top 5 acquiring institutions
banks['Acquiring Institution'].value_counts().iloc[:6]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Community & Southern Bank               8
Name: Acquiring Institution, dtype: int64

In [197]:
banks[banks['Acquiring Institution']=='State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,06-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,02-Jul-09,26-Oct-12

In [199]:
## what is the most common city in california for a bank to fail in
banks[banks['ST']=='CA'].groupby('City').count().sort_values('Bank Name',ascending = False).head(1)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

In [200]:
##how many banks dont have the word bank in their name
sum(banks['Bank Name'].apply(lambda name: 'Bank' not in name))

14

In [202]:
##how many banks name start with letter s
sum(banks['Bank Name'].apply(lambda name : name[0].upper()=='S'))

53

In [203]:
## how many banks just have 2 owrd name
sum(banks['Bank Name'].apply(lambda name : len (name.split())==2))

114

In [205]:
## most common city in california for a bank to fail in
banks[banks['ST']=='CA'].groupby('City').count().sort_values('Bank Name',ascending = False).head(1)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

In [206]:
##how many banks closed in 2008
banks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551 entries, 0 to 550
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              551 non-null    object
 1   City                   551 non-null    object
 2   ST                     551 non-null    object
 3   CERT                   551 non-null    int64
 4   Acquiring Institution  551 non-null    object
 5   Closing Date           551 non-null    object
 6   Updated Date           551 non-null    object
dtypes: int64(1), object(6)
memory usage: 30.3+ KB

In [207]:
sum(banks['Closing Date'].apply(lambda date :date[-2:]=='08'))

25

In [208]:
sum(pd.to_datetime(banks['Closing Date']).apply(lambda date: date.year == 2008))

25